In [15]:
import pandas as pd

In [60]:
df=pd.read_csv("FinalAttendance.csv",header=None)
df.head()

           0         1         2
0  CHAITANYA  10:30:05  06/17/21
1  CHAITANYA  10:30:52  06/17/21
2  CHAITANYA  10:54:52  06/17/21

In [61]:
df.head()

           0         1         2
0  CHAITANYA  10:30:05  06/17/21
1  CHAITANYA  10:30:52  06/17/21
2  CHAITANYA  10:54:52  06/17/21

In [62]:
s=df[0]

In [63]:
print(len(s))
print(s)

3
0    CHAITANYA
1    CHAITANYA
2    CHAITANYA
Name: 0, dtype: object

In [64]:
df.head()

           0         1         2
0  CHAITANYA  10:30:05  06/17/21
1  CHAITANYA  10:30:52  06/17/21
2  CHAITANYA  10:54:52  06/17/21

In [107]:
gk=df.groupby(0).get_group("CHAITANYA")[0]

In [108]:
ct=gk.count()#update database
nme=gk.iloc[0]

In [115]:
l=[nme]
dict={'Name':l,'present':0}
nf=pd.DataFrame(dict)
nf.head()
nf['present']+=3
nf.head()

        Name  present
0  CHAITANYA        3